public/man/man1/screendump.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - screendump.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - screendump.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>screendump - dump the contents of a virtual console to stdout</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>screendump</strong> [ <em>N</em> ]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>The <strong>screendump</strong> command dumps the contents of virtual console <strong>N</strong> , (or
the current console if N is omitted) to standard out.</p>
<p>
Just saying</p>
<blockquote>
<p>cat /dev/vcsN</p>
</blockquote>
<p>
has a similar effect.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
NOTES
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>For security reasons, <strong>screendump</strong> uses linux devices &#34;virtual console
screen&#34; and &#34;virtual console screen with attributes&#34; to give access for
screendump.</p>
<p>
Ensure these files exist, using</p>
<blockquote>
<p>cd /dev for i in 0 1 2 3 …; do<br>
mknod vcs$i c 7 $i<br>
mknod vcsa$i c 7 `expr 128 + $i`<br>
done</p>
</blockquote>
<p>
(filling in the ellipses) and give the device files appropriate
permissions, or run <strong>screendump</strong> as root.</p>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
SEE ALSO
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>*setterm*(1)</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
